-------------------------------------------------------------------------------
      name:  check
       log:  /Users/nik/Desktop/data/t01.log
  log type:  text
 opened on:  12 Feb 2021, 15:31:48

. 
. use panel_version.dta, clear

. 
. gen age_sq = age * age

. 
. 
. ******** covid analysis ******* 
. drop if timing == 2
(2,017 observations deleted)

. gen post = 0

. replace post = 1 if timing == 1
(2,017 real changes made)

. 
. correlate
(uasid ignored because string variable)
(obs=3,758)

             |   timing   gender      age stater~e marita~s livewi~r anyhhm~r
-------------+---------------------------------------------------------------
      timing |   1.0000
      gender |   0.0004   1.0000
         age |   0.0672   0.1206   1.0000
 statereside |   0.0028  -0.0069   0.0100   1.0000
maritalsta~s |  -0.0092  -0.1435  -0.1346  -0.0656   1.0000
livewithpa~r |  -0.0064   0.1242  -0.0104   0.0510  -0.7633   1.0000
 anyhhmember |   0.0074   0.0475  -0.1592   0.0322  -0.4594   0.5710   1.0000
hhmembernu~r |   0.0322  -0.0184  -0.3857   0.0500  -0.2961   0.3403   0.5470
  live_nurse |   0.1135  -0.0117   0.0581   0.0131   0.0114  -0.0009  -0.0186
   education |   0.0039   0.0230   0.0076  -0.0172  -0.0955   0.0506  -0.0219
  hisplatino |  -0.0048  -0.0333  -0.1764  -0.0750   0.0401  -0.0047   0.0548
       white |  -0.0004   0.0233   0.1024   0.1412  -0.1798   0.1470   0.0745
       black |  -0.0014  -0.0671  -0.0812  -0.0937   0.1982  -0.1664  -0.0512
  nativeamer |   0.0048   0.0374  -0.0325  -0.0266   0.0358  -0.0047  -0.0168
       asian |   0.0017   0.0099  -0.0459  -0.0974   0.0351  -0.0458  -0.0643
     pacific |   0.0146   0.0130  -0.0590  -0.0430   0.0075  -0.0133  -0.0123
        race |   0.0091   0.0064  -0.0742  -0.0972   0.1046  -0.0780  -0.0510
     working |  -0.0058   0.0543  -0.3426  -0.0070  -0.0329   0.0596   0.0577
  sick_leave |  -0.0371  -0.0194  -0.0074   0.0247   0.0061  -0.0264   0.0164
unemp_layoff |  -0.0015   0.0120  -0.0276  -0.0128  -0.0340   0.0328   0.0258
  unemp_look |  -0.0134  -0.0364  -0.1503  -0.0360   0.0938  -0.0526   0.0015
     retired |   0.0326   0.0780   0.6133  -0.0260  -0.0561  -0.0130  -0.1015
 laborstatus |   0.0377  -0.0501   0.3097  -0.0063   0.0371  -0.0590  -0.0639
   hourswork |  -0.0167   0.1313  -0.3146   0.0019  -0.0384   0.0640   0.0579
    hhincome |   0.0320   0.1463   0.0376   0.0291  -0.3553   0.3436   0.2543
 life_satisf |   0.0120  -0.0476  -0.0488   0.0016   0.2291  -0.2131  -0.0920
   take_risk |  -0.0270   0.1168  -0.0174  -0.0374   0.0378  -0.0221  -0.0354
health_young |   0.0002  -0.0283  -0.1341   0.0001   0.0695  -0.0432   0.0072
respirator~g |   0.0011  -0.0336  -0.0555   0.0463   0.0067  -0.0132  -0.0086
depress_yo~g |   0.0049  -0.1135  -0.1544   0.0278   0.1167  -0.0876  -0.0264
emotional_~g |   0.0023  -0.0778  -0.1131  -0.0199   0.0749  -0.0445   0.0126
  health_now |  -0.0026  -0.0202   0.0705   0.0599   0.1025  -0.0957  -0.0533
lung_disease |   0.0641  -0.0268   0.1063   0.0597   0.0106  -0.0112  -0.0212
emotional_~w |   0.0155  -0.1473  -0.0888   0.0426   0.0809  -0.0565  -0.0145
 depress_now |   0.0899  -0.1426  -0.0518   0.0140   0.0817  -0.0727  -0.0300
    exercise |   0.0054  -0.1480   0.1241   0.0367   0.0323  -0.0541  -0.0310
depress_la~k |   0.0161  -0.0904  -0.1129   0.0030   0.0748  -0.0570   0.0009
happy_last~k |   0.0059   0.0395   0.0443  -0.0119  -0.0886   0.0676   0.0413
lonely_las~k |   0.0125  -0.1030  -0.0975   0.0255   0.2209  -0.2124  -0.1434
sad_last_w~k |   0.0165  -0.1530  -0.1440   0.0122   0.1388  -0.1171  -0.0504
parent_smoke |   0.0024  -0.0030  -0.2003  -0.0290  -0.0178   0.0178   0.0125
 smoke_young |   0.0014   0.0149   0.0650   0.0620   0.0203   0.0092   0.0018
 ever_smoked |  -0.0005   0.0316   0.1295   0.0255   0.0475  -0.0192  -0.0301
   smoke_now |  -0.0071  -0.0412  -0.0557   0.0344   0.1176  -0.0694  -0.0501
  number_cig |  -0.0153  -0.0223  -0.0422   0.0293   0.0654  -0.0338  -0.0276
  start_date |   0.9751   0.0054   0.0954  -0.0043  -0.0070  -0.0116  -0.0010
  start_year |   0.9838   0.0081   0.0858   0.0107  -0.0141  -0.0099   0.0036
 start_month |   0.1006  -0.0166   0.0717  -0.0906   0.0398  -0.0114  -0.0285
    end_date |   0.9752   0.0055   0.0953  -0.0046  -0.0075  -0.0111  -0.0009
    end_year |   0.9843   0.0076   0.0854   0.0101  -0.0148  -0.0091   0.0035
   end_month |   0.0950  -0.0124   0.0730  -0.0876   0.0402  -0.0136  -0.0271
      policy |  -0.0002  -0.0195  -0.0348  -0.1547   0.0506  -0.0431  -0.0122
case_rate_~h |  -0.0004   0.0091  -0.0105  -0.1437  -0.0494   0.0299   0.0125
death_rate~h |  -0.0028   0.0640   0.0920  -0.2533   0.0230  -0.0146  -0.0108
case_death~h |  -0.0040   0.0102   0.0328  -0.2950  -0.0169   0.0025   0.0056
      age_sq |   0.0660   0.1171   0.9865   0.0031  -0.0960  -0.0383  -0.1693
        post |   1.0000   0.0004   0.0672   0.0028  -0.0092  -0.0064   0.0074

             | hhmemb~r live_n~e educat~n hispla~o    white    black native~r
-------------+---------------------------------------------------------------
hhmembernu~r |   1.0000
  live_nurse |  -0.0311   1.0000
   education |  -0.0161  -0.0658   1.0000
  hisplatino |   0.0914   0.0089  -0.0553   1.0000
       white |   0.0317  -0.0230   0.0481   0.0091   1.0000
       black |  -0.0248   0.0094  -0.0443  -0.0370  -0.7935   1.0000
  nativeamer |  -0.0061   0.0146  -0.0498   0.0686  -0.1677   0.0473   1.0000
       asian |  -0.0380   0.0130   0.0747  -0.0355  -0.3207  -0.0155   0.1019
     pacific |   0.0083  -0.0102  -0.0036   0.0357  -0.1416  -0.0049   0.0186
        race |  -0.0387   0.0099  -0.0041   0.0207  -0.4185   0.3595   0.6809
     working |   0.1287  -0.0579   0.1823   0.0285  -0.0444   0.0455  -0.0063
  sick_leave |   0.0143   0.0146   0.0055  -0.0028  -0.0068   0.0133   0.0324
unemp_layoff |   0.0229   0.0065  -0.0354   0.0127  -0.0132   0.0218   0.0046
  unemp_look |   0.0831   0.0167  -0.0934   0.0714  -0.0174   0.0086   0.0192
     retired |  -0.2563   0.0388   0.0059  -0.0978   0.0742  -0.0721  -0.0180
 laborstatus |  -0.1164   0.0454  -0.1709  -0.0197   0.0660  -0.0588   0.0198
   hourswork |   0.1180  -0.0618   0.1898   0.0145  -0.0379   0.0437  -0.0045
    hhincome |   0.1607  -0.0665   0.4109  -0.0513   0.1532  -0.1676  -0.0253
 life_satisf |  -0.0450  -0.0151  -0.0778  -0.0054  -0.0314   0.0473   0.0067
   take_risk |  -0.0370  -0.0024   0.0852   0.0346  -0.0506   0.0424   0.0433
health_young |   0.0207  -0.0086  -0.0784   0.0563  -0.0187   0.0030   0.0288
respirator~g |   0.0080   0.0124   0.0712  -0.0100   0.0342   0.0010   0.0264
depress_yo~g |   0.0288   0.0158  -0.0623   0.0024   0.0339  -0.0157   0.0798
emotional_~g |   0.0316  -0.0107  -0.0751   0.0278   0.0117   0.0037   0.0461
  health_now |  -0.0566   0.0299  -0.2583  -0.0041  -0.0167   0.0322   0.0289
lung_disease |  -0.0362   0.0543  -0.0761  -0.0312   0.0225  -0.0178   0.0351
emotional_~w |   0.0446   0.0016  -0.0590  -0.0067   0.0776  -0.0677   0.0236
 depress_now |   0.0074   0.0751  -0.0412  -0.0038   0.0431  -0.0188   0.0346
    exercise |  -0.0395   0.0128  -0.2128  -0.0625  -0.0032   0.0249  -0.0291
depress_la~k |   0.0443  -0.0018  -0.1048   0.0246   0.0219  -0.0114   0.0013
happy_last~k |   0.0282  -0.0085   0.0887  -0.0258   0.0188  -0.0268  -0.0280
lonely_las~k |  -0.0341   0.0108  -0.0811   0.0060  -0.0006   0.0161   0.0199
sad_last_w~k |   0.0142  -0.0128  -0.0816   0.0220   0.0170  -0.0128   0.0062
parent_smoke |   0.0730  -0.0088   0.0632   0.1160  -0.0560   0.0182   0.0395
 smoke_young |  -0.0302   0.0197  -0.1924  -0.0603   0.0926  -0.0821   0.0079
 ever_smoked |  -0.0565   0.0389  -0.2014  -0.0779   0.0797  -0.0576  -0.0187
   smoke_now |   0.0147   0.0256  -0.1980  -0.0345  -0.0147   0.0333  -0.0015
  number_cig |   0.0124   0.0095  -0.1841  -0.0586   0.0220  -0.0071  -0.0105
  start_date |   0.0187   0.1089  -0.0035  -0.0198  -0.0054   0.0019   0.0090
  start_year |   0.0259   0.1127  -0.0035  -0.0186   0.0042  -0.0050   0.0097
 start_month |  -0.0393  -0.0054  -0.0000  -0.0115  -0.0586   0.0402  -0.0029
    end_date |   0.0191   0.1087  -0.0034  -0.0193  -0.0055   0.0021   0.0090
    end_year |   0.0260   0.1126  -0.0033  -0.0180   0.0030  -0.0036   0.0095
   end_month |  -0.0375  -0.0060   0.0003  -0.0119  -0.0510   0.0325  -0.0017
      policy |  -0.0095   0.0023   0.0655   0.2045  -0.0605   0.0066   0.0106
case_rate_~h |  -0.0031   0.0228  -0.0398  -0.0961   0.0022   0.0043   0.0249
death_rate~h |  -0.0338  -0.0176  -0.0256  -0.1303  -0.0025   0.0524  -0.0244
case_death~h |  -0.0293  -0.0092  -0.0366  -0.0709  -0.0449   0.0561   0.0058
      age_sq |  -0.3925   0.0604   0.0005  -0.1620   0.0972  -0.0802  -0.0354
        post |   0.0322   0.1135   0.0039  -0.0048  -0.0004  -0.0014   0.0048

             |    asian  pacific     race  working sick_l~e unemp_~f unemp_~k
-------------+---------------------------------------------------------------
       asian |   1.0000
     pacific |   0.1167   1.0000
        race |   0.4659   0.3406   1.0000
     working |   0.0401  -0.0036   0.0277   1.0000
  sick_leave |  -0.0134  -0.0076   0.0241  -0.0822   1.0000
unemp_layoff |  -0.0008   0.0745   0.0364  -0.1189  -0.0102   1.0000
  unemp_look |  -0.0076   0.0178  -0.0011  -0.2864   0.0021   0.0602   1.0000
     retired |  -0.0360  -0.0256  -0.0530  -0.5360  -0.0287  -0.0435  -0.1132
 laborstatus |  -0.0420  -0.0042  -0.0157  -0.8310   0.0389   0.0898   0.1936
   hourswork |   0.0384   0.0142   0.0347   0.8990   0.0317  -0.1092  -0.2685
    hhincome |   0.0499   0.0312  -0.0322   0.3338  -0.0155  -0.0491  -0.2401
 life_satisf |   0.0050   0.0096   0.0383  -0.0482   0.0557   0.0062   0.1026
   take_risk |   0.0287   0.0257   0.0669   0.0692   0.0112   0.0093   0.0296
health_young |   0.0320   0.0157   0.0410  -0.0341  -0.0227  -0.0234   0.0765
respirator~g |  -0.0021   0.0168   0.0482  -0.0013   0.0205   0.0313  -0.0021
depress_yo~g |   0.0020  -0.0273   0.0490  -0.0484   0.0327  -0.0203   0.0937
emotional_~g |   0.0091   0.0323   0.0652  -0.0824   0.0538   0.0320   0.0593
  health_now |  -0.0451  -0.0125   0.0164  -0.2499   0.0902   0.0239   0.0566
lung_disease |  -0.0324  -0.0184   0.0028  -0.1505   0.0378   0.0207   0.0086
emotional_~w |   0.0091  -0.0158   0.0157  -0.1285   0.0573   0.0435   0.0368
 depress_now |  -0.0108  -0.0266   0.0225  -0.0949   0.0198   0.0220   0.0816
    exercise |  -0.0278  -0.0531  -0.0358  -0.1477   0.0337   0.0007   0.0248
depress_la~k |  -0.0189  -0.0070  -0.0043  -0.1034   0.0405   0.0180   0.0984
happy_last~k |  -0.0281   0.0204  -0.0360   0.1067  -0.0416  -0.0142  -0.0719
lonely_las~k |  -0.0077   0.0067   0.0234  -0.0823   0.0629  -0.0010   0.1026
sad_last_w~k |  -0.0138   0.0199   0.0000  -0.0600   0.0493   0.0210   0.1166
parent_smoke |   0.0372  -0.0043   0.0170   0.0984  -0.0076  -0.0091   0.0137
 smoke_young |  -0.0073  -0.0139  -0.0063  -0.0611   0.0112   0.0096   0.0236
 ever_smoked |  -0.0502   0.0162  -0.0267  -0.1005   0.0251   0.0090   0.0058
   smoke_now |  -0.0169   0.0348   0.0196  -0.0654   0.0042   0.0517   0.0923
  number_cig |  -0.0324   0.0187  -0.0085  -0.0789  -0.0005   0.0306   0.0768
  start_date |   0.0018   0.0188   0.0143  -0.0263  -0.0337   0.0074  -0.0073
  start_year |  -0.0039   0.0172   0.0093  -0.0175  -0.0331   0.0024  -0.0119
 start_month |   0.0356   0.0114   0.0307  -0.0568  -0.0040   0.0348   0.0231
    end_date |   0.0018   0.0186   0.0144  -0.0261  -0.0339   0.0077  -0.0073
    end_year |  -0.0041   0.0171   0.0094  -0.0170  -0.0332   0.0023  -0.0123
   end_month |   0.0355   0.0109   0.0297  -0.0595  -0.0044   0.0351   0.0249
      policy |   0.1352   0.0788   0.0933   0.0538  -0.0375   0.0114  -0.0008
case_rate_~h |  -0.0816  -0.0334  -0.0401   0.0037   0.0032  -0.0527  -0.0162
death_rate~h |  -0.1049  -0.0615  -0.0771  -0.0138   0.0039  -0.0103  -0.0308
case_death~h |  -0.0710  -0.0312  -0.0348  -0.0048  -0.0101  -0.0474  -0.0097
      age_sq |  -0.0395  -0.0563  -0.0733  -0.3766  -0.0102  -0.0309  -0.1415
        post |   0.0017   0.0146   0.0091  -0.0058  -0.0371  -0.0015  -0.0134

             |  retired labors~s hoursw~k hhincome life_s~f take_r~k health~g
-------------+---------------------------------------------------------------
     retired |   1.0000
 laborstatus |   0.5043   1.0000
   hourswork |  -0.5106  -0.7986   1.0000
    hhincome |  -0.0142  -0.3152   0.3736   1.0000
 life_satisf |  -0.0988   0.0585  -0.0573  -0.2495   1.0000
   take_risk |  -0.0219  -0.0673   0.0854   0.0770  -0.1290   1.0000
health_young |  -0.0749   0.0378  -0.0487  -0.1400   0.1559  -0.0362   1.0000
respirator~g |  -0.0275   0.0102   0.0035   0.0175   0.0505  -0.0082   0.2388
depress_yo~g |  -0.1154   0.0553  -0.0506  -0.1674   0.1687  -0.0174   0.1758
emotional_~g |  -0.0791   0.0839  -0.0823  -0.1268   0.1191   0.0158   0.1552
  health_now |  -0.0014   0.2337  -0.2205  -0.3345   0.3712  -0.1329   0.2675
lung_disease |   0.0361   0.1594  -0.1388  -0.1185   0.0582  -0.0248   0.0533
emotional_~w |  -0.0740   0.1551  -0.1270  -0.1548   0.1866  -0.0751   0.1279
 depress_now |  -0.0526   0.1367  -0.1049  -0.1763   0.1356  -0.0420   0.1277
    exercise |   0.0379   0.1332  -0.1488  -0.2280   0.1419  -0.1721   0.0717
depress_la~k |  -0.0961   0.1009  -0.1042  -0.2227   0.3110  -0.0860   0.1087
happy_last~k |   0.0870  -0.0950   0.0995   0.1897  -0.3403   0.1160  -0.1292
lonely_las~k |  -0.0744   0.0783  -0.0702  -0.2229   0.3250  -0.0745   0.1134
sad_last_w~k |  -0.1188   0.0539  -0.0614  -0.1859   0.3125  -0.0681   0.1375
parent_smoke |  -0.1108  -0.0727   0.0749   0.0260  -0.0461  -0.0039  -0.0400
 smoke_young |  -0.0244   0.0738  -0.0477  -0.1401   0.0953  -0.0159   0.0414
 ever_smoked |   0.0632   0.1071  -0.0854  -0.1420   0.1019   0.0016   0.0171
   smoke_now |  -0.0938   0.0574  -0.0557  -0.2379   0.1669  -0.0180  -0.0056
  number_cig |  -0.0727   0.0690  -0.0634  -0.2230   0.1248  -0.0275  -0.0100
  start_date |   0.0438   0.0502  -0.0319   0.0172   0.0176  -0.0281  -0.0090
  start_year |   0.0427   0.0439  -0.0259   0.0239   0.0174  -0.0313  -0.0025
 start_month |   0.0132   0.0453  -0.0389  -0.0376   0.0029   0.0177  -0.0402
    end_date |   0.0438   0.0499  -0.0316   0.0171   0.0175  -0.0281  -0.0094
    end_year |   0.0427   0.0433  -0.0253   0.0239   0.0172  -0.0325  -0.0027
   end_month |   0.0135   0.0481  -0.0416  -0.0381   0.0040   0.0257  -0.0422
      policy |  -0.0219  -0.0318   0.0505   0.0555   0.0285   0.0331  -0.0105
case_rate_~h |   0.0111  -0.0147   0.0085  -0.0244  -0.0301   0.0049  -0.0011
death_rate~h |   0.0602   0.0036  -0.0082  -0.0212  -0.0056   0.0083  -0.0307
case_death~h |   0.0319  -0.0068   0.0055  -0.0453  -0.0104  -0.0007  -0.0037
      age_sq |   0.6632   0.3385  -0.3538   0.0154  -0.0614  -0.0160  -0.1244
        post |   0.0326   0.0377  -0.0167   0.0320   0.0120  -0.0270   0.0002

             | respir~g depres~g emotio~g health~w lung_d~e emotio~w depres~w
-------------+---------------------------------------------------------------
respirator~g |   1.0000
depress_yo~g |   0.1063   1.0000
emotional_~g |   0.1090   0.5019   1.0000
  health_now |   0.0488   0.1344   0.1362   1.0000
lung_disease |   0.1033   0.0352   0.0448   0.1757   1.0000
emotional_~w |   0.1528   0.3720   0.3944   0.2444   0.1177   1.0000
 depress_now |   0.0975   0.3515   0.2804   0.1694   0.1213   0.4516   1.0000
    exercise |   0.0155   0.0567   0.0041   0.3621   0.1042   0.1106   0.1071
depress_la~k |   0.0444   0.2273   0.1599   0.2347   0.0771   0.2961   0.2152
happy_last~k |  -0.0315  -0.1606  -0.0985  -0.2318  -0.0624  -0.1844  -0.1650
lonely_las~k |   0.0364   0.2271   0.1720   0.2151   0.0612   0.2529   0.1901
sad_last_w~k |   0.0416   0.2320   0.1636   0.2332   0.0554   0.2576   0.2269
parent_smoke |  -0.0222  -0.0386  -0.0692  -0.0635  -0.0534  -0.0448  -0.0448
 smoke_young |   0.0190   0.1272   0.0810   0.1762   0.1272   0.1216   0.1290
 ever_smoked |  -0.0074   0.0952   0.1004   0.1806   0.1151   0.1438   0.1230
   smoke_now |  -0.0320   0.1130   0.1008   0.1973   0.0882   0.1570   0.1367
  number_cig |  -0.0249   0.0952   0.0866   0.1809   0.1320   0.1512   0.1270
  start_date |  -0.0084  -0.0001   0.0031   0.0099   0.0640   0.0093   0.0906
  start_year |  -0.0026  -0.0012  -0.0002   0.0086   0.0678   0.0127   0.0914
 start_month |  -0.0328   0.0056   0.0212   0.0078  -0.0119  -0.0167   0.0095
    end_date |  -0.0086  -0.0001   0.0031   0.0098   0.0637   0.0093   0.0910
    end_year |  -0.0031  -0.0016  -0.0005   0.0083   0.0676   0.0120   0.0912
   end_month |  -0.0308   0.0084   0.0242   0.0085  -0.0122  -0.0124   0.0136
      policy |   0.0038  -0.0239   0.0014  -0.0563  -0.0419  -0.0270  -0.0064
case_rate_~h |   0.0007   0.0346  -0.0157   0.0228  -0.0087   0.0237   0.0077
death_rate~h |  -0.0478   0.0076   0.0149  -0.0072   0.0009  -0.0233   0.0025
case_death~h |  -0.0232   0.0112  -0.0182   0.0235  -0.0251   0.0027   0.0117
      age_sq |  -0.0602  -0.1438  -0.1043   0.0548   0.1022  -0.0924  -0.0563
        post |   0.0011   0.0049   0.0023  -0.0026   0.0641   0.0155   0.0899

             | exercise depres~k happy_~k lonely~k sad_la~k parent~e smoke_~g
-------------+---------------------------------------------------------------
    exercise |   1.0000
depress_la~k |   0.1457   1.0000
happy_last~k |  -0.1389  -0.4519   1.0000
lonely_las~k |   0.1194   0.4223  -0.2909   1.0000
sad_last_w~k |   0.1295   0.5143  -0.3292   0.5448   1.0000
parent_smoke |  -0.0548  -0.0046   0.0193   0.0090  -0.0027   1.0000
 smoke_young |   0.1101   0.1023  -0.0662   0.0995   0.1079  -0.1180   1.0000
 ever_smoked |   0.1189   0.0863  -0.0307   0.0957   0.0818  -0.1409   0.5424
   smoke_now |   0.1222   0.1607  -0.1221   0.1388   0.1353  -0.0823   0.3237
  number_cig |   0.1087   0.1486  -0.1055   0.1283   0.1192  -0.0722   0.3101
  start_date |   0.0090   0.0163   0.0038   0.0193   0.0170  -0.0099   0.0028
  start_year |   0.0098   0.0166   0.0061   0.0183   0.0155  -0.0044   0.0061
 start_month |  -0.0017   0.0025  -0.0154   0.0103   0.0143  -0.0347  -0.0176
    end_date |   0.0091   0.0163   0.0037   0.0193   0.0169  -0.0093   0.0030
    end_year |   0.0104   0.0171   0.0053   0.0183   0.0160  -0.0041   0.0061
   end_month |  -0.0060  -0.0014  -0.0113   0.0090   0.0095  -0.0329  -0.0165
      policy |  -0.0983  -0.0123   0.0025  -0.0160  -0.0197   0.0619  -0.0147
case_rate_~h |   0.0496   0.0032  -0.0095   0.0022   0.0130   0.0057  -0.0161
death_rate~h |   0.0213  -0.0147   0.0151  -0.0194  -0.0007  -0.0662   0.0236
case_death~h |   0.0555  -0.0026  -0.0176  -0.0088  -0.0010  -0.0244  -0.0238
      age_sq |   0.1200  -0.1144   0.0534  -0.0869  -0.1438  -0.1883   0.0506
        post |   0.0054   0.0161   0.0059   0.0125   0.0165   0.0024   0.0014

             | ever_s~d smoke_~w number~g start_~e start_~r start_~h end_date
-------------+---------------------------------------------------------------
 ever_smoked |   1.0000
   smoke_now |   0.4550   1.0000
  number_cig |   0.3637   0.7994   1.0000
  start_date |   0.0031  -0.0070  -0.0093   1.0000
  start_year |   0.0077  -0.0063  -0.0100   0.9870   1.0000
 start_month |  -0.0249  -0.0044   0.0025   0.2344   0.0762   1.0000
    end_date |   0.0030  -0.0072  -0.0095   0.9999   0.9868   0.2346   1.0000
    end_year |   0.0070  -0.0069  -0.0104   0.9866   0.9994   0.0780   0.9868
   end_month |  -0.0222  -0.0026   0.0039   0.2322   0.0766   0.9830   0.2320
      policy |  -0.0356  -0.0320  -0.0532  -0.0075  -0.0123   0.0280  -0.0073
case_rate_~h |  -0.0012   0.0281   0.0523  -0.0058   0.0006  -0.0353  -0.0054
death_rate~h |   0.0603   0.0413   0.0415  -0.0008   0.0056  -0.0376  -0.0006
case_death~h |   0.0058   0.0225   0.0478  -0.0012  -0.0010   0.0015  -0.0006
      age_sq |   0.1219  -0.0717  -0.0550   0.0937   0.0839   0.0724   0.0936
        post |  -0.0005  -0.0071  -0.0153   0.9751   0.9838   0.1006   0.9752

             | end_year end_mo~h   policy case_r~h death_~h case_d~h   age_sq
-------------+---------------------------------------------------------------
    end_year |   1.0000
   end_month |   0.0728   1.0000
      policy |  -0.0117   0.0244   1.0000
case_rate_~h |   0.0005  -0.0320  -0.4884   1.0000
death_rate~h |   0.0047  -0.0310  -0.3105   0.3771   1.0000
case_death~h |  -0.0014   0.0072  -0.3747   0.8116   0.6255   1.0000
      age_sq |   0.0835   0.0738  -0.0301  -0.0113   0.0918   0.0335   1.0000
        post |   0.9843   0.0950  -0.0002  -0.0004  -0.0028  -0.0040   0.0660

             |     post
-------------+---------
        post |   1.0000


. 
. reg smoke_now post

      Source |       SS           df       MS      Number of obs   =     4,032
-------------+----------------------------------   F(1, 4030)      =      0.26
       Model |  .033935933         1  .033935933   Prob > F        =    0.6073
    Residual |  517.679358     4,030  .128456416   R-squared       =    0.0001
-------------+----------------------------------   Adj R-squared   =   -0.0002
       Total |  517.713294     4,031  .128432968   Root MSE        =    .35841

------------------------------------------------------------------------------
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.0058023   .0112888    -0.51   0.607    -.0279346      .01633
       _cons |   .1541894   .0079804    19.32   0.000     .1385434    .1698354
------------------------------------------------------------------------------

. 
. 
. 
. *** the strictness of lockdown policies ***
. gen did_policy = post * policy

. 
. reg smoke_now post policy did_policy, cluster(statereside)

Linear regression                               Number of obs     =      4,032
                                                F(3, 50)          =       0.95
                                                Prob > F          =     0.4229
                                                R-squared         =     0.0007
                                                Root MSE          =     .35839

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.0060934   .0051563    -1.18   0.243    -.0164502    .0042634
      policy |   -.019013   .0241692    -0.79   0.435    -.0675583    .0295323
  did_policy |   .0011137   .0097277     0.11   0.909     -.018425    .0206524
       _cons |   .1610895    .010742    15.00   0.000     .1395135    .1826654
------------------------------------------------------------------------------

. reg smoke_now age age_sq post policy did_policy, cluster(statereside)

Linear regression                               Number of obs     =      4,032
                                                F(5, 50)          =      10.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0127
                                                Root MSE          =     .35632

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0130677   .0023848     5.48   0.000     .0082776    .0178578
      age_sq |  -.0001425   .0000236    -6.05   0.000    -.0001899   -.0000952
        post |  -.0033573   .0050052    -0.67   0.505    -.0134105    .0066959
      policy |  -.0176199   .0230678    -0.76   0.449    -.0639529    .0287131
  did_policy |  -.0003252   .0097439    -0.03   0.974    -.0198965     .019246
       _cons |  -.1064126   .0566869    -1.88   0.066    -.2202716    .0074465
------------------------------------------------------------------------------

. reg smoke_now maritalstatus hhincome life_satisf post policy did_policy, clus
> ter(statereside)

Linear regression                               Number of obs     =      4,024
                                                F(6, 50)          =      22.75
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0697
                                                Root MSE          =      .3462

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
maritalsta~s |   .0031637      .0048     0.66   0.513    -.0064774    .0128048
    hhincome |  -.0179996   .0031038    -5.80   0.000    -.0242337   -.0117655
 life_satisf |     .05095   .0097431     5.23   0.000     .0313804    .0705195
        post |  -.0011301    .005302    -0.21   0.832    -.0117795    .0095193
      policy |  -.0111352   .0236307    -0.47   0.640     -.058599    .0363285
  did_policy |  -.0033146   .0096605    -0.34   0.733    -.0227183    .0160892
       _cons |   .2260218   .0542495     4.17   0.000     .1170585    .3349852
------------------------------------------------------------------------------

. 
. reg number_cig age age_sq post policy did_policy, cluster(statereside)

Linear regression                               Number of obs     =      4,027
                                                F(5, 50)          =       8.24
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0107
                                                Root MSE          =     6.7848

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
  number_cig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .1977837   .0638551     3.10   0.003     .0695269    .3260405
      age_sq |  -.0021635   .0006197    -3.49   0.001    -.0034082   -.0009188
        post |  -.3029673   .1211295    -2.50   0.016    -.5462631   -.0596715
      policy |   -.795801   .5308469    -1.50   0.140    -1.862038    .2704364
  did_policy |   .1796597    .173529     1.04   0.305    -.1688836    .5282029
       _cons |  -1.310747   1.554387    -0.84   0.403    -4.432826    1.811332
------------------------------------------------------------------------------

. reg number_cig maritalstatus hhincome life_satisf post policy did_policy, clu
> ster(statereside)

Linear regression                               Number of obs     =      4,019
                                                F(6, 50)          =      19.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0568
                                                Root MSE          =     6.6316

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
  number_cig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
maritalsta~s |  -.0862486   .0884461    -0.98   0.334    -.2638978    .0914006
    hhincome |  -.3555006   .0618632    -5.75   0.000    -.4797565   -.2312447
 life_satisf |   .6854811   .2636115     2.60   0.012     .1560018     1.21496
        post |  -.2478871   .1423999    -1.74   0.088    -.5339057    .0381314
      policy |  -.6203625   .5108234    -1.21   0.230    -1.646381    .4056565
  did_policy |   .1292967   .1807819     0.72   0.478    -.2338145    .4924078
       _cons |   5.124727   1.144386     4.48   0.000      2.82616    7.423293
------------------------------------------------------------------------------

. 
. 
. 
. *** case rate ***
. gen did_case = post * case_rate_high

. reg smoke_now post case_rate_high did_case, cluster(statereside)

Linear regression                               Number of obs     =      4,032
                                                F(3, 50)          =       0.84
                                                Prob > F          =     0.4799
                                                R-squared         =     0.0006
                                                Root MSE          =     .35841

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.0065149   .0059701    -1.09   0.280    -.0185061    .0054764
case_rate_~h |   .0151406   .0199059     0.76   0.450    -.0248417    .0551228
    did_case |   .0018492   .0090775     0.20   0.839    -.0163836     .020082
       _cons |    .147929   .0166561     8.88   0.000     .1144743    .1813837
------------------------------------------------------------------------------

. reg smoke_now post age age_sq case_rate_high did_case, cluster(statereside)

Linear regression                               Number of obs     =      4,032
                                                F(5, 50)          =      10.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0125
                                                Root MSE          =     .35635

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.0045829    .005922    -0.77   0.443    -.0164776    .0073119
         age |   .0131462   .0023821     5.52   0.000     .0083616    .0179308
      age_sq |  -.0001431   .0000235    -6.09   0.000    -.0001903   -.0000959
case_rate_~h |   .0138493   .0191512     0.72   0.473    -.0246171    .0523156
    did_case |   .0024123   .0090129     0.27   0.790    -.0156906    .0205152
       _cons |  -.1209028   .0555717    -2.18   0.034    -.2325217   -.0092838
------------------------------------------------------------------------------

. reg smoke_now maritalstatus hhincome life_satisf post case_rate_high did_case
> , cluster(statereside)

Linear regression                               Number of obs     =      4,024
                                                F(6, 50)          =      34.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0698
                                                Root MSE          =     .34617

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
maritalsta~s |   .0031355   .0047039     0.67   0.508    -.0063125    .0125834
    hhincome |    -.01805   .0031078    -5.81   0.000    -.0242922   -.0118078
 life_satisf |   .0509622   .0098458     5.18   0.000     .0311863    .0707382
        post |  -.0049057   .0057891    -0.85   0.401    -.0165335     .006722
case_rate_~h |   .0120429   .0190494     0.63   0.530    -.0262191    .0503048
    did_case |   .0061676   .0090968     0.68   0.501    -.0121038     .024439
       _cons |   .2175848   .0595956     3.65   0.001     .0978835    .3372861
------------------------------------------------------------------------------

. 
. reg number_cig post age age_sq case_rate_high did_case, cluster(statereside)

Linear regression                               Number of obs     =      4,027
                                                F(5, 50)          =       7.98
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0103
                                                Root MSE          =     6.7864

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
  number_cig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.1629237   .0748103    -2.18   0.034    -.3131846   -.0126629
         age |   .2009098   .0636927     3.15   0.003     .0729793    .3288402
      age_sq |   -.002186   .0006154    -3.55   0.001     -.003422     -.00095
case_rate_~h |   .7156621   .4533255     1.58   0.121    -.1948689    1.626193
    did_case |  -.1912021   .1979326    -0.97   0.339    -.5887616    .2063573
       _cons |  -1.989234   1.512904    -1.31   0.195     -5.02799    1.049523
------------------------------------------------------------------------------

. 
. 
. *** death rate ***
. gen did_death = post * death_rate_high

. reg smoke_now post death_rate_high did_death, cluster(statereside)

Linear regression                               Number of obs     =      4,032
                                                F(3, 50)          =       1.56
                                                Prob > F          =     0.2114
                                                R-squared         =     0.0012
                                                Root MSE          =     .35829

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.0008892   .0059829    -0.15   0.882    -.0129062    .0111279
death_rate~h |   .0287236   .0209052     1.37   0.176    -.0132657    .0707129
   did_death |  -.0089908   .0085018    -1.06   0.295    -.0260671    .0080855
       _cons |   .1387097   .0180444     7.69   0.000     .1024663     .174953
------------------------------------------------------------------------------

. reg smoke_now age age_sq post death_rate_high did_death, cluster(statereside)

Linear regression                               Number of obs     =      4,032
                                                F(5, 50)          =      10.59
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0136
                                                Root MSE          =     .35615

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0130793   .0023869     5.48   0.000      .008285    .0178736
      age_sq |  -.0001433   .0000235    -6.10   0.000    -.0001905   -.0000961
        post |   .0006268   .0057069     0.11   0.913    -.0108359    .0120894
death_rate~h |   .0313691    .019941     1.57   0.122    -.0086836    .0714219
   did_death |  -.0074134   .0084388    -0.88   0.384    -.0243634    .0095365
       _cons |   -.128214   .0562904    -2.28   0.027    -.2412766   -.0151514
------------------------------------------------------------------------------

. reg smoke_now maritalstatus hhincome life_satisf post death_rate_high did_dea
> th, cluster(statereside)

Linear regression                               Number of obs     =      4,024
                                                F(6, 50)          =      25.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0704
                                                Root MSE          =     .34606

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
maritalsta~s |    .002847    .004658     0.61   0.544    -.0065089    .0122029
    hhincome |  -.0181103   .0030876    -5.87   0.000    -.0243119   -.0119086
 life_satisf |    .050931   .0098833     5.15   0.000     .0310797    .0707822
        post |  -.0007076   .0054472    -0.13   0.897    -.0116487    .0102334
death_rate~h |   .0247167   .0193453     1.28   0.207    -.0141394    .0635729
   did_death |  -.0029728   .0085747    -0.35   0.730    -.0201957    .0142501
       _cons |   .2107145   .0560011     3.76   0.000     .0982331     .323196
------------------------------------------------------------------------------

. 
. reg number_cig age age_sq post death_rate_high did_death, cluster(statereside
> )

Linear regression                               Number of obs     =      4,027
                                                F(5, 50)          =       8.34
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0100
                                                Root MSE          =     6.7873

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
  number_cig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .2000639   .0639664     3.13   0.003     .0715835    .3285442
      age_sq |  -.0021968   .0006163    -3.56   0.001    -.0034346    -.000959
        post |  -.0796736   .0973946    -0.82   0.417    -.2752965    .1159493
death_rate~h |   .7100539    .485546     1.46   0.150    -.2651939    1.685302
   did_death |  -.2942969   .1772159    -1.66   0.103    -.6502456    .0616518
       _cons |  -2.006834   1.515687    -1.32   0.192     -5.05118    1.037512
------------------------------------------------------------------------------

. 
. 
. *** case death rate combined ***
. gen did_both = post * death_rate_high

. reg smoke_now post death_rate_high did_both, cluster(statereside)

Linear regression                               Number of obs     =      4,032
                                                F(3, 50)          =       1.56
                                                Prob > F          =     0.2114
                                                R-squared         =     0.0012
                                                Root MSE          =     .35829

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.0008892   .0059829    -0.15   0.882    -.0129062    .0111279
death_rate~h |   .0287236   .0209052     1.37   0.176    -.0132657    .0707129
    did_both |  -.0089908   .0085018    -1.06   0.295    -.0260671    .0080855
       _cons |   .1387097   .0180444     7.69   0.000     .1024663     .174953
------------------------------------------------------------------------------

. reg smoke_now age age_sq post death_rate_high did_both, cluster(statereside)

Linear regression                               Number of obs     =      4,032
                                                F(5, 50)          =      10.59
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0136
                                                Root MSE          =     .35615

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .0130793   .0023869     5.48   0.000      .008285    .0178736
      age_sq |  -.0001433   .0000235    -6.10   0.000    -.0001905   -.0000961
        post |   .0006268   .0057069     0.11   0.913    -.0108359    .0120894
death_rate~h |   .0313691    .019941     1.57   0.122    -.0086836    .0714219
    did_both |  -.0074134   .0084388    -0.88   0.384    -.0243634    .0095365
       _cons |   -.128214   .0562904    -2.28   0.027    -.2412766   -.0151514
------------------------------------------------------------------------------

. reg smoke_now maritalstatus hhincome life_satisf post death_rate_high did_bot
> h, cluster(statereside)

Linear regression                               Number of obs     =      4,024
                                                F(6, 50)          =      25.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0704
                                                Root MSE          =     .34606

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
maritalsta~s |    .002847    .004658     0.61   0.544    -.0065089    .0122029
    hhincome |  -.0181103   .0030876    -5.87   0.000    -.0243119   -.0119086
 life_satisf |    .050931   .0098833     5.15   0.000     .0310797    .0707822
        post |  -.0007076   .0054472    -0.13   0.897    -.0116487    .0102334
death_rate~h |   .0247167   .0193453     1.28   0.207    -.0141394    .0635729
    did_both |  -.0029728   .0085747    -0.35   0.730    -.0201957    .0142501
       _cons |   .2107145   .0560011     3.76   0.000     .0982331     .323196
------------------------------------------------------------------------------

. 
. 
. 
. 
. *************** emotion variables ***************
. *** depress_last_week ***
. sort uasid timing

. gen depress_last_week_stable = depress_last_week
(32 missing values generated)

. replace depress_last_week_stable = depress_last_week_stable[_n-1] if uasid ==
>  uasid[_n-1]
(265 real changes made, 31 to missing)

. 
. gen did = post * depress_last_week_stable
(62 missing values generated)

. 
. reg smoke_now post age age_sq depress_last_week_stable did, cluster(uasid)

Linear regression                               Number of obs     =      3,972
                                                F(5, 1985)        =      15.85
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0337
                                                Root MSE          =     .35229

                              (Std. Err. adjusted for 1,986 clusters in uasid)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.0028387   .0052868    -0.54   0.591    -.0132069    .0075296
         age |     .01277   .0024149     5.29   0.000     .0080341     .017506
      age_sq |  -.0001354   .0000229    -5.91   0.000    -.0001804   -.0000905
depress_la~e |   .1893877   .0350246     5.41   0.000     .1206989    .2580765
         did |  -.0186263   .0216656    -0.86   0.390     -.061116    .0238633
       _cons |  -.1349531   .0593022    -2.28   0.023    -.2512542   -.0186519
------------------------------------------------------------------------------

. reg number_cig post age age_sq depress_last_week_stable did, cluster(uasid)

Linear regression                               Number of obs     =      3,967
                                                F(5, 1985)        =      10.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0242
                                                Root MSE          =     6.7608

                              (Std. Err. adjusted for 1,986 clusters in uasid)
------------------------------------------------------------------------------
             |               Robust
  number_cig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.1417378   .1144851    -1.24   0.216    -.3662614    .0827859
         age |   .1974674   .0567059     3.48   0.001     .0862581    .3086766
      age_sq |  -.0020915    .000524    -3.99   0.000    -.0031192   -.0010638
depress_la~e |   3.456807   .7562284     4.57   0.000     1.973722    4.939892
         did |  -1.101966   .4680282    -2.35   0.019    -2.019844   -.1840877
       _cons |  -2.100996   1.458468    -1.44   0.150    -4.961284    .7592917
------------------------------------------------------------------------------

. 
. *** depress now ***
. gen depress_now_stable = depress_now
(5 missing values generated)

. replace depress_now_stable = depress_now_stable[_n-1] if uasid == uasid[_n-1]
(125 real changes made, 2 to missing)

. gen did_depress_now = post * depress_now_stable
(4 missing values generated)

. 
. reg smoke_now post age age_sq depress_now_stable did_depress_now, cluster(uas
> id)

Linear regression                               Number of obs     =      4,030
                                                F(5, 2014)        =      19.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0407
                                                Root MSE          =      .3513

                              (Std. Err. adjusted for 2,015 clusters in uasid)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.0027142   .0054415    -0.50   0.618    -.0133858    .0079574
         age |   .0119517   .0023903     5.00   0.000      .007264    .0166394
      age_sq |  -.0001286   .0000228    -5.64   0.000    -.0001733   -.0000839
depress_no~e |   .1448281   .0215666     6.72   0.000     .1025329    .1871233
did_depres~w |  -.0064023   .0141024    -0.45   0.650    -.0340591    .0212544
       _cons |  -.1297874   .0582636    -2.23   0.026    -.2440506   -.0155243
------------------------------------------------------------------------------

. reg smoke_now maritalstatus hhincome life_satisf post depress_now_stable did_
> depress_now, cluster(statereside)

Linear regression                               Number of obs     =      4,024
                                                F(6, 50)          =      25.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0837
                                                Root MSE          =     .34358

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
maritalsta~s |   .0029427   .0047587     0.62   0.539    -.0066155    .0125009
    hhincome |  -.0164572   .0029122    -5.65   0.000    -.0223066   -.0106078
 life_satisf |   .0429321   .0096859     4.43   0.000     .0234773    .0623869
        post |  -.0013837     .00518    -0.27   0.790    -.0117881    .0090207
depress_no~e |   .1053277   .0233302     4.51   0.000     .0584676    .1521877
did_depres~w |   -.005077   .0144184    -0.35   0.726    -.0340371    .0238831
       _cons |   .1988485   .0534276     3.72   0.001     .0915359    .3061611
------------------------------------------------------------------------------

. 
. 
. reg number_cig post age age_sq depress_now_stable did_depress_now, cluster(ua
> sid)

Linear regression                               Number of obs     =      4,025
                                                F(5, 2014)        =      14.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0375
                                                Root MSE          =     6.6939

                              (Std. Err. adjusted for 2,015 clusters in uasid)
------------------------------------------------------------------------------
             |               Robust
  number_cig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.1864882   .1047109    -1.78   0.075    -.3918412    .0188648
         age |   .1788304   .0556629     3.21   0.001     .0696675    .2879934
      age_sq |  -.0019171   .0005153    -3.72   0.000    -.0029277   -.0009065
depress_no~e |   2.863706   .4782766     5.99   0.000     1.925738    3.801675
did_depres~w |  -.2850341   .3481749    -0.82   0.413    -.9678546    .3977865
       _cons |  -2.012071   1.436161    -1.40   0.161    -4.828587    .8044454
------------------------------------------------------------------------------

. 
. 
. *** emotional now *** 
. gen emotional_now_stable = emotional_now
(3 missing values generated)

. replace emotional_now_stable = emotional_now_stable[_n-1] if uasid == uasid[_
> n-1]
(110 real changes made, 2 to missing)

. gen did_emotional_now = post * emotional_now_stable
(4 missing values generated)

. 
. reg smoke_now post age age_sq emotional_now_stable did_emotional_now, cluster
> (uasid)

Linear regression                               Number of obs     =      4,030
                                                F(5, 2014)        =      16.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0341
                                                Root MSE          =     .35251

                              (Std. Err. adjusted for 2,015 clusters in uasid)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |   .0000878   .0052601     0.02   0.987     -.010228    .0104036
         age |   .0125345   .0024018     5.22   0.000     .0078242    .0172449
      age_sq |  -.0001339   .0000228    -5.87   0.000    -.0001786   -.0000892
emotional_~e |   .1504456   .0247721     6.07   0.000      .101864    .1990272
did_emotio~w |  -.0247462   .0170208    -1.45   0.146    -.0581265    .0086341
       _cons |  -.1363546   .0590878    -2.31   0.021    -.2522341   -.0204751
------------------------------------------------------------------------------

. reg smoke_now maritalstatus hhincome life_satisf post emotional_now_stable di
> d_emotional_now, cluster(statereside)

Linear regression                               Number of obs     =      4,024
                                                F(6, 50)          =      24.39
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0799
                                                Root MSE          =      .3443

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
maritalsta~s |   .0028232     .00457     0.62   0.540    -.0063558    .0120023
    hhincome |  -.0169563   .0029066    -5.83   0.000    -.0227943   -.0111182
 life_satisf |    .044004   .0098805     4.45   0.000     .0241584    .0638496
        post |   .0023159   .0047963     0.48   0.631    -.0073177    .0119495
emotional_~e |   .1100272   .0265184     4.15   0.000     .0567634     .163291
did_emotio~w |  -.0266759   .0185499    -1.44   0.157    -.0639345    .0105828
       _cons |   .2078459   .0524593     3.96   0.000     .1024783    .3132136
------------------------------------------------------------------------------

. 
. 
. reg number_cig post age age_sq emotional_now_stable did_emotional_now, cluste
> r(uasid)

Linear regression                               Number of obs     =      4,025
                                                F(5, 2014)        =      12.35
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0307
                                                Root MSE          =     6.7175

                              (Std. Err. adjusted for 2,015 clusters in uasid)
------------------------------------------------------------------------------
             |               Robust
  number_cig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.1607733   .1150448    -1.40   0.162    -.3863925    .0648459
         age |   .1899578   .0557329     3.41   0.001     .0806576     .299258
      age_sq |  -.0020179   .0005146    -3.92   0.000    -.0030272   -.0010086
emotional_~e |   2.921092   .5208168     5.61   0.000     1.899696    3.942488
did_emotio~w |   -.537132    .353836    -1.52   0.129    -1.231055    .1567908
       _cons |  -2.122564   1.447198    -1.47   0.143    -4.960726    .7155972
------------------------------------------------------------------------------

. 
. 
. *** happy last week ***
. gen happy_last_week_stable = happy_last_week
(32 missing values generated)

. replace happy_last_week_stable = happy_last_week_stable[_n-1] if uasid == uas
> id[_n-1]
(412 real changes made, 31 to missing)

. gen did_happy_last_week = post * happy_last_week_stable
(62 missing values generated)

. 
. reg smoke_now post age age_sq happy_last_week_stable did_happy_last_week, clu
> ster(uasid)

Linear regression                               Number of obs     =      3,972
                                                F(5, 1985)        =      14.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0234
                                                Root MSE          =     .35416

                              (Std. Err. adjusted for 1,986 clusters in uasid)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.0048692   .0169814    -0.29   0.774    -.0381726    .0284341
         age |   .0123472   .0024393     5.06   0.000     .0075633    .0171311
      age_sq |  -.0001335   .0000232    -5.76   0.000     -.000179   -.0000881
happy_last~e |  -.1033582   .0250908    -4.12   0.000    -.1525652   -.0541512
did_happy_~k |   .0008628   .0177392     0.05   0.961    -.0339266    .0356523
       _cons |  -.0152703   .0640372    -0.24   0.812    -.1408575    .1103168
------------------------------------------------------------------------------

. reg smoke_now maritalstatus hhincome life_satisf post happy_last_week_stable 
> did_happy_last_week, cluster(statereside)

Linear regression                               Number of obs     =      3,966
                                                F(6, 50)          =      28.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0711
                                                Root MSE          =     .34567

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
maritalsta~s |   .0032718   .0046406     0.71   0.484    -.0060491    .0125927
    hhincome |  -.0177901   .0031512    -5.65   0.000    -.0241194   -.0114607
 life_satisf |   .0437851   .0105021     4.17   0.000      .022691    .0648792
        post |  -.0038555   .0160123    -0.24   0.811    -.0360171    .0283062
happy_last~e |  -.0454581   .0200331    -2.27   0.028    -.0856958   -.0052205
did_happy_~k |   .0015884   .0182697     0.09   0.931    -.0351074    .0382843
       _cons |   .2741579   .0584058     4.69   0.000     .1568465    .3914693
------------------------------------------------------------------------------

. 
. 
. reg number_cig post age age_sq happy_last_week_stable did_happy_last_week, cl
> uster(uasid)

Linear regression                               Number of obs     =      3,967
                                                F(5, 1985)        =      11.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0198
                                                Root MSE          =      6.776

                              (Std. Err. adjusted for 1,986 clusters in uasid)
------------------------------------------------------------------------------
             |               Robust
  number_cig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.5316814   .4595987    -1.16   0.247    -1.433028    .3696651
         age |   .1878165   .0567068     3.31   0.001     .0766053    .2990277
      age_sq |  -.0020283    .000525    -3.86   0.000    -.0030579   -.0009987
happy_last~e |  -2.149195   .5908872    -3.64   0.000     -3.30802   -.9903713
did_happy_~k |   .3511677   .4740888     0.74   0.459    -.5785962    1.280932
       _cons |   .3233978   1.530442     0.21   0.833    -2.678044     3.32484
------------------------------------------------------------------------------

. 
. 
. *** lonely last week ***
. gen lonely_last_week_stable = lonely_last_week
(32 missing values generated)

. replace lonely_last_week_stable = lonely_last_week_stable[_n-1] if uasid == u
> asid[_n-1]
(429 real changes made, 31 to missing)

. gen did_lonely_last_week = post * lonely_last_week_stable
(62 missing values generated)

. 
. reg smoke_now post age age_sq lonely_last_week_stable did_lonely_last_week, c
> luster(uasid)

Linear regression                               Number of obs     =      3,972
                                                F(5, 1985)        =      17.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0342
                                                Root MSE          =     .35219

                              (Std. Err. adjusted for 1,986 clusters in uasid)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.0018626   .0056159    -0.33   0.740    -.0128762     .009151
         age |   .0142164   .0023978     5.93   0.000      .009514    .0189189
      age_sq |  -.0001508   .0000227    -6.63   0.000    -.0001954   -.0001063
lonely_las~e |   .1446849   .0245258     5.90   0.000     .0965859     .192784
did_lonely~k |  -.0138867   .0143753    -0.97   0.334     -.042079    .0143055
       _cons |  -.1743386   .0589178    -2.96   0.003    -.2898858   -.0587915
------------------------------------------------------------------------------

. reg smoke_now maritalstatus hhincome life_satisf post lonely_last_week_stable
>  did_lonely_last_week, cluster(statereside)

Linear regression                               Number of obs     =      3,966
                                                F(6, 50)          =      20.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0745
                                                Root MSE          =     .34502

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
maritalsta~s |   .0009816   .0047407     0.21   0.837    -.0085403    .0105035
    hhincome |  -.0175611   .0031252    -5.62   0.000    -.0238381    -.011284
 life_satisf |   .0419539   .0096773     4.34   0.000     .0225165    .0613914
        post |  -.0018556   .0055965    -0.33   0.742    -.0130965    .0093853
lonely_las~e |   .0742101   .0221505     3.35   0.002     .0297194    .1187007
did_lonely~k |  -.0040266   .0144679    -0.28   0.782    -.0330863    .0250331
       _cons |   .2302302    .055792     4.13   0.000     .1181687    .3422918
------------------------------------------------------------------------------

. 
. 
. reg number_cig post age age_sq lonely_last_week_stable did_lonely_last_week, 
> cluster(uasid)

Linear regression                               Number of obs     =      3,967
                                                F(5, 1985)        =      12.71
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0278
                                                Root MSE          =     6.7481

                              (Std. Err. adjusted for 1,986 clusters in uasid)
------------------------------------------------------------------------------
             |               Robust
  number_cig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.1138125   .1009941    -1.13   0.260     -.311878    .0842529
         age |   .2223249   .0556102     4.00   0.000     .1132644    .3313853
      age_sq |  -.0023506   .0005164    -4.55   0.000    -.0033633   -.0013379
lonely_las~e |   2.807442   .5960091     4.71   0.000     1.638573    3.976311
did_lonely~k |  -.7153395   .4524527    -1.58   0.114    -1.602672    .1719926
       _cons |  -2.831701   1.390328    -2.04   0.042    -5.558356   -.1050465
------------------------------------------------------------------------------

. 
. *** sad last week ***
. gen sad_last_week_stable = sad_last_week
(31 missing values generated)

. replace sad_last_week_stable = sad_last_week_stable[_n-1] if uasid == uasid[_
> n-1]
(491 real changes made, 30 to missing)

. gen did_sad_last_week = post * sad_last_week_stable
(60 missing values generated)

. 
. reg smoke_now post age age_sq sad_last_week_stable did_sad_last_week, cluster
> (uasid)

Linear regression                               Number of obs     =      3,974
                                                F(5, 1986)        =      18.59
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0339
                                                Root MSE          =     .35217

                              (Std. Err. adjusted for 1,987 clusters in uasid)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.0013971   .0055551    -0.25   0.801    -.0122915    .0094974
         age |    .013247   .0023817     5.56   0.000     .0085761    .0179178
      age_sq |  -.0001394   .0000226    -6.16   0.000    -.0001838    -.000095
sad_last_w~e |    .135273   .0225802     5.99   0.000     .0909897    .1795564
did_sad_la~k |  -.0150213   .0139481    -1.08   0.282    -.0423757    .0123331
       _cons |  -.1603845   .0583518    -2.75   0.006    -.2748217   -.0459472
------------------------------------------------------------------------------

. reg smoke_now maritalstatus hhincome life_satisf post sad_last_week_stable di
> d_sad_last_week, cluster(statereside)

Linear regression                               Number of obs     =      3,968
                                                F(6, 50)          =      28.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0763
                                                Root MSE          =     .34462

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
maritalsta~s |   .0022721   .0046703     0.49   0.629    -.0071086    .0116527
    hhincome |  -.0174018   .0031538    -5.52   0.000    -.0237364   -.0110672
 life_satisf |   .0397296    .009825     4.04   0.000     .0199955    .0594636
        post |  -.0012651   .0051821    -0.24   0.808    -.0116738    .0091435
sad_last_w~e |   .0800046   .0228924     3.49   0.001     .0340239    .1259853
did_sad_la~k |  -.0053003   .0135135    -0.39   0.697     -.032443    .0218425
       _cons |   .2259856   .0556449     4.06   0.000     .1142195    .3377516
------------------------------------------------------------------------------

. 
. reg number_cig post age age_sq sad_last_week_stable did_sad_last_week, cluste
> r(uasid)

Linear regression                               Number of obs     =      3,969
                                                F(5, 1986)        =      12.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0247
                                                Root MSE          =     6.7574

                              (Std. Err. adjusted for 1,987 clusters in uasid)
------------------------------------------------------------------------------
             |               Robust
  number_cig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.0217964    .103141    -0.21   0.833    -.2240724    .1804796
         age |   .2058057   .0558373     3.69   0.000     .0962999    .3153115
      age_sq |  -.0021621   .0005192    -4.16   0.000    -.0031804   -.0011439
sad_last_w~e |   2.563671   .5250797     4.88   0.000     1.533906    3.593436
did_sad_la~k |   -1.01123   .3832936    -2.64   0.008     -1.76293   -.2595302
       _cons |  -2.572787   1.392637    -1.85   0.065    -5.303971    .1583965
------------------------------------------------------------------------------

. 
. 
. 
. 
. *** live with partner ***
. gen livewithpartner_stable = livewithpartner

. replace livewithpartner_stable = livewithpartner_stable[_n-1] if uasid == uas
> id[_n-1]
(84 real changes made)

. gen did_livewithpartner = post * livewithpartner_stable

. 
. reg smoke_now post age age_sq livewithpartner_stable did_livewithpartner, clu
> ster(uasid)

Linear regression                               Number of obs     =      4,032
                                                F(5, 2016)        =      13.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0167
                                                Root MSE          =     .35558

                              (Std. Err. adjusted for 2,017 clusters in uasid)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |   .0010168   .0105178     0.10   0.923    -.0196101    .0216437
         age |   .0148661   .0025206     5.90   0.000     .0099229    .0198094
      age_sq |  -.0001605   .0000239    -6.72   0.000    -.0002073   -.0001137
livewithpa~e |  -.0513654   .0186663    -2.75   0.006    -.0879727   -.0147582
did_livewi~r |  -.0064664    .012034    -0.54   0.591    -.0300667    .0171339
       _cons |  -.1173287    .059735    -1.96   0.050    -.2344776   -.0001799
------------------------------------------------------------------------------

. reg smoke_now maritalstatus hhincome life_satisf post livewithpartner_stable 
> did_livewithpartner, cluster(statereside)

Linear regression                               Number of obs     =      4,024
                                                F(6, 50)          =      25.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0747
                                                Root MSE          =     .34527

                           (Std. Err. adjusted for 51 clusters in statereside)
------------------------------------------------------------------------------
             |               Robust
   smoke_now |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
maritalsta~s |   .0157772   .0059823     2.64   0.011     .0037613    .0277931
    hhincome |  -.0187263   .0029681    -6.31   0.000     -.024688   -.0127647
 life_satisf |   .0519226   .0099356     5.23   0.000     .0319663    .0718789
        post |   .0104762   .0123165     0.85   0.399    -.0142623    .0352148
livewithpa~e |    .091644   .0229663     3.99   0.000     .0455149    .1377731
did_livewi~r |  -.0174909   .0138939    -1.26   0.214    -.0453976    .0104158
       _cons |   .1297262   .0615877     2.11   0.040     .0060236    .2534287
------------------------------------------------------------------------------

. 
. reg number_cig post age age_sq livewithpartner_stable did_livewithpartner, cl
> uster(uasid)

Linear regression                               Number of obs     =      4,027
                                                F(5, 2016)        =      10.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0092
                                                Root MSE          =     6.7901

                              (Std. Err. adjusted for 2,017 clusters in uasid)
------------------------------------------------------------------------------
             |               Robust
  number_cig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        post |  -.0550414   .2416446    -0.23   0.820    -.5289405    .4188577
         age |   .2163585   .0587875     3.68   0.000      .101068    .3316491
      age_sq |  -.0023433   .0005466    -4.29   0.000    -.0034153   -.0012713
livewithpa~e |  -.3271881   .3713789    -0.88   0.378    -1.055515    .4011384
did_livewi~r |  -.2649985   .2748967    -0.96   0.335    -.8041098    .2741129
       _cons |  -1.805472   1.425898    -1.27   0.206    -4.601859    .9909148
------------------------------------------------------------------------------

. 
. 
. 
. log close check
      name:  check
       log:  /Users/nik/Desktop/data/t01.log
  log type:  text
 closed on:  12 Feb 2021, 15:31:49
-------------------------------------------------------------------------------
